Repository: xjanova/PostXAgent
Catalog: AIManagerCore/src/AIManager.UI/Resources/Strings.*.resx
Languages: th_th

# WebLearning_Description
source: Teach AI to work on websites by recording your actions
th_th: สอน AI ทำงานบนเว็บไซต์โดยบันทึกการกระทำของคุณ

# WebLearning_TeachMode
source: TEACH MODE
th_th: โหมดสอน

# WebLearning_StartRecording
source: Start Recording
th_th: เริ่มบันทึก

# WebLearning_StopRecording
source: Stop Recording
th_th: หยุดบันทึก

# WebLearning_RecordedSteps
source: Recorded Steps
th_th: ขั้นตอนที่บันทึก

# WebLearning_StepsRecorded
source: {0} steps recorded
th_th: บันทึกได้ {0} ขั้นตอน

# WebLearning_WorkflowConfidence
source: Workflow Confidence
th_th: ความมั่นใจ Workflow

# WebLearning_WorkflowName
source: Workflow Name
th_th: ชื่อ Workflow

# WebLearning_Description_Hint
source: Description (optional)
th_th: คำอธิบาย (ไม่บังคับ)

# WebLearning_Test
source: Test
th_th: ทดสอบ

# WebLearning_SaveWorkflow
source: Save Workflow
th_th: บันทึก Workflow

# WebLearning_AiSuggestions
source: AI Suggestions
th_th: คำแนะนำจาก AI

# WebLearning_LoadingPage
source: Loading page...
th_th: กำลังโหลดหน้าเว็บ...

# WebLearning_RecordingStarted
source: Recording started. Please interact with the website...
th_th: เริ่มบันทึกแล้ว กรุณาทำงานบนเว็บไซต์...

# WebLearning_RecordingStopped
source: Recording stopped! {0} steps captured (Confidence: {1:P0})
th_th: บันทึกเสร็จสิ้น! ได้ {0} ขั้นตอน (ความมั่นใจ: {1:P0})

# WebLearning_NoStepsRecorded
source: No actions were recorded
th_th: ยังไม่มีการกระทำที่บันทึกได้

# WebLearning_StepDeleted
source: Step deleted
th_th: ลบ Step แล้ว

# WebLearning_StepDuplicated
source: Step #{0} duplicated
th_th: คัดลอก Step #{0} แล้ว

# WebLearning_WorkflowSaved
source: Workflow '{0}' saved successfully! ({1} steps)
th_th: บันทึก '{0}' สำเร็จ! ({1} ขั้นตอน)

# WebLearning_EnterWorkflowName
source: Please enter a workflow name
th_th: กรุณากรอกชื่อ Workflow

# WebLearning_NoStepsToSave
source: No steps to save
th_th: ยังไม่มี Steps ที่จะบันทึก

# Confidence_High
source: High
th_th: สูง

# Confidence_Medium
source: Medium
th_th: ปานกลาง

# Confidence_Low
source: Low
th_th: ต่ำ

# Action_Click
source: Click
th_th: คลิก

# Action_Type
source: Type Text
th_th: พิมพ์ข้อความ

# Action_Upload
source: Upload File
th_th: อัพโหลดไฟล์

# Action_Select
source: Select Option
th_th: เลือกตัวเลือก

# Action_Navigate
source: Navigate
th_th: นำทาง

# Action_Submit
source: Submit Form
th_th: ส่งฟอร์ม

# Platform_Custom
source: Custom
th_th: กำหนดเอง

# TaskType_Post
source: Post Content
th_th: โพสต์เนื้อหา

# TaskType_Login
source: Login
th_th: เข้าสู่ระบบ

# TaskType_Upload
source: Upload Media
th_th: อัพโหลดสื่อ

# TaskType_Comment
source: Comment
th_th: แสดงความคิดเห็น

# TaskType_Search
source: Search
th_th: ค้นหา

# TaskType_Message
source: Send Message
th_th: ส่งข้อความ

# TaskType_Custom
source: Custom
th_th: กำหนดเอง

# Monitor_Title
source: Workflow Monitor
th_th: ตรวจสอบ Workflow

# Monitor_TotalWorkflows
source: Total Workflows
th_th: Workflow ทั้งหมด

# Monitor_Running
source: Running
th_th: กำลังทำงาน

# Monitor_Pending
source: Pending
th_th: รอดำเนินการ

# Monitor_Failed
source: Failed
th_th: ล้มเหลว

# Monitor_Completed
source: Completed
th_th: เสร็จสิ้น

# Monitor_CompletedToday
source: Completed Today
th_th: เสร็จวันนี้

# Common_Undo
source: Undo
th_th: เลิกทำ

# Common_Redo
source: Redo
th_th: ทำซ้ำ

# Common_Delete
source: Delete
th_th: ลบ

# Common_Duplicate
source: Duplicate
th_th: คัดลอก

# Common_MoveUp
source: Move Up
th_th: เลื่อนขึ้น

# Common_MoveDown
source: Move Down
th_th: เลื่อนลง

# Common_ClearAll
source: Clear All
th_th: ล้างทั้งหมด

# Common_Cancel
source: Cancel
th_th: ยกเลิก

# Common_Save
source: Save
th_th: บันทึก

# Common_Go
source: Go
th_th: ไป

# Common_Refresh
source: Refresh
th_th: รีเฟรช

# Common_Back
source: Back
th_th: ย้อนกลับ

# Common_Forward
source: Forward
th_th: ไปข้างหน้า

# AutoLearning_Title
source: AI Auto-Learning Active
th_th: AI เรียนรู้อัตโนมัติ

# AutoLearning_Description
source: AI is analyzing the webpage and learning automatically
th_th: AI กำลังวิเคราะห์หน้าเว็บและเรียนรู้อัตโนมัติ

# AutoLearning_ToggleLabel
source: Auto Learning
th_th: เรียนรู้อัตโนมัติ

# AutoLearning_Enabled
source: AI Auto-Learning mode enabled - AI will analyze and learn automatically
th_th: เปิดโหมด AI Auto-Learning - AI จะวิเคราะห์และเรียนรู้อัตโนมัติ

# AutoLearning_Disabled
source: Auto-Learning mode disabled
th_th: ปิดโหมด Auto-Learning แล้ว

# AutoLearning_Analyzing
source: Analyzing page...
th_th: กำลังวิเคราะห์หน้าเว็บ...

# AutoLearning_Complete
source: Analysis complete
th_th: วิเคราะห์เสร็จสิ้น

# AutoLearning_Error
source: Analysis error
th_th: เกิดข้อผิดพลาดในการวิเคราะห์

# AutoLearning_DetectedElements
source: Detected Elements:
th_th: ตรวจพบ Elements:

# AutoLearning_WorkflowsFound
source: Found {0} existing workflows
th_th: พบ {0} workflow ที่มีอยู่แล้ว

# AutoLearning_SuggestTeaching
source: (AI teaching recommended)
th_th: (แนะนำให้สอน AI)

# AutoLearning_GenerateWorkflow
source: Generate Workflow
th_th: สร้าง Workflow

# AutoLearning_TransferLearning
source: Transfer Learning
th_th: ถ่ายโอนการเรียนรู้

# AutoLearning_GeneratingWorkflow
source: Generating workflow automatically...
th_th: กำลังสร้าง Workflow อัตโนมัติ...

# AutoLearning_GenerateSuccess
source: Workflow generated successfully - please review before saving
th_th: สร้าง Workflow สำเร็จ - กรุณาตรวจสอบก่อนบันทึก

# AutoLearning_NoPatterns
source: Insufficient patterns found
th_th: ไม่พบ patterns ที่เพียงพอ

# AutoLearning_TransferSuccess
source: Transfer Learning successful! {0} steps
th_th: Transfer Learning สำเร็จ! {0} steps

# AutoLearning_NoHumanWorkflows
source: No human-trained workflows found. Please record at least one workflow before using Transfer Learning.
th_th: ยังไม่มี Workflow ที่มนุษย์สอนไว้ กรุณาบันทึก workflow อย่างน้อย 1 รายการก่อนใช้ Transfer Learning

# AutoLearning_TransferConfirm
source: Found {0} workflows available for transfer. Do you want to transfer learning from the best workflow?
th_th: พบ {0} workflows ที่สามารถ transfer ได้ ต้องการ transfer learning จาก workflow ที่ดีที่สุดหรือไม่?

# WorkerWebView_Title
source: Worker View
th_th: ดู Worker

# WorkerWebView_Description
source: Monitor and assist workers
th_th: ดูและช่วยเหลือ workers

# WorkerWebView_NeedsHelp
source: NEEDS HELP
th_th: ต้องการความช่วยเหลือ

# WorkerWebView_ActiveWorkers
source: ACTIVE WORKERS
th_th: WORKERS ที่ใช้งานอยู่

# WorkerWebView_NoWorkerSelected
source: Select a Worker to View
th_th: เลือก Worker เพื่อดู

# WorkerWebView_SelectWorkerHint
source: Choose a worker from the sidebar to see its browser view
th_th: เลือก worker จากแถบด้านข้างเพื่อดูหน้าเว็บ

# WorkerWebView_ViewOnly
source: View Only
th_th: ดูอย่างเดียว

# WorkerWebView_Assist
source: Assist
th_th: ช่วยเหลือ

# WorkerWebView_TakeControl
source: TAKE CONTROL
th_th: เข้าควบคุม

# WorkerWebView_DoneTeaching
source: Done Teaching
th_th: สอนเสร็จแล้ว

# WorkerWebView_ViewOnlyMode
source: VIEW ONLY MODE
th_th: โหมดดูอย่างเดียว

# WorkerWebView_ViewOnlyHint
source: Click 'Assist' or 'Take Control' to interact
th_th: คลิก 'ช่วยเหลือ' หรือ 'เข้าควบคุม' เพื่อโต้ตอบ

# WorkerWebView_Recording
source: RECORDING
th_th: กำลังบันทึก

# WorkerWebView_StepsRecorded
source: {0} steps recorded
th_th: บันทึกได้ {0} ขั้นตอน

# WorkerWebView_ProcessingSteps
source: Processing learned steps...
th_th: กำลังประมวลผลขั้นตอนที่เรียนรู้...

# WorkerWebView_TakeControlConfirm
source: This will pause the worker and give you full control. Continue?
th_th: การดำเนินการนี้จะหยุด worker และให้คุณควบคุมเต็มที่ ต้องการดำเนินการต่อหรือไม่?

# WorkerWebView_Status_Viewing
source: View Only
th_th: ดูอย่างเดียว

# WorkerWebView_Status_NeedsHelp
source: Needs Help
th_th: ต้องการความช่วยเหลือ

# WorkerWebView_Status_Recording
source: Recording
th_th: กำลังบันทึก

# WorkerWebView_Status_Learning
source: Learning
th_th: กำลังเรียนรู้

# WorkerWebView_Status_Resuming
source: Resuming
th_th: กำลังกลับมาทำงาน

# Teaching_Subtitle
source: Follow these steps to teach AI
th_th: ทำตามขั้นตอนเพื่อสอน AI

# Teaching_FollowSteps
source: Follow the steps below to teach AI to create a {0} workflow
th_th: ทำตามขั้นตอนด้านล่างเพื่อสอน AI สร้าง {0} workflow

# Teaching_StepProgress
source: Step {0}/{1}
th_th: ขั้นตอน {0}/{1}

# Teaching_StepCorrect
source: Step {0} completed correctly!
th_th: ขั้นตอนที่ {0} ถูกต้อง!

# Teaching_StepWrong
source: Expected: {0} - Got: {1}
th_th: คาดหวัง: {0} - แต่ได้: {1}

# Teaching_Optional
source: (optional)
th_th: (ข้ามได้)

# Teaching_Complete
source: Teaching complete! Please name and save the workflow.
th_th: สอน AI เสร็จสมบูรณ์! กรุณาตั้งชื่อและบันทึก Workflow

# Teaching_NoTemplate
source: No template found for this platform - recording freely
th_th: ไม่พบ template สำหรับ platform นี้ - บันทึกอิสระ

# Teaching_ElementHint
source: Element hint
th_th: ตำแหน่ง element

# Teaching_InputHint
source: Input hint
th_th: ข้อมูลที่ต้องกรอก

# Teaching_ClickAction
source: CLICK
th_th: คลิก

# Teaching_TypeAction
source: TYPE
th_th: พิมพ์

# Teaching_UploadAction
source: UPLOAD
th_th: อัพโหลด

# Teaching_SelectAction
source: SELECT
th_th: เลือก

# Teaching_SubmitAction
source: SUBMIT
th_th: ส่ง
